class Agreement {
  static String personalCollection = """
  # 개인정보 수집 및 이용 목적
- 회원 가입 및 관리: 회원 가입을 위한 본인 식별, 본인 확인, 회원자격 유지, 관리 및 부정 이용 방지
- 상담 및 서비스 제공: 서비스 이용 시 문의사항 또는 불만 처리, 서비스 제공, 제품 및 서비스의 배송 및 청구서 등 발송
- 마케팅 및 광고에 활용: 신규 서비스(제품) 개발 및 특화, 이벤트 및 광고성 정보 제공 및 참여 기회 제공
- 서비스 이용 기록과 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계

# 수집하는 개인정보의 항목
- 필수항목: 이름, 아이디, 비밀번호, 이메일 주소, 휴대폰 번호, 주소 등
- 선택항목: 성별, 생년월일, 관심분야, 서비스 이용 기록 등

# 개인정보의 보유 및 이용 기간
- 회원 탈퇴 또는 개인정보 삭제 요청 시까지 또는 회원 탈퇴 시 또는 개인정보 삭제 요청 시 지체 없이 파기

# 동의 거부 권리 및 동의 철회 방법
- 서비스 이용 도중 개인정보 수집에 대한 동의를 거부할 수 있습니다. 다만, 동의를 거부할 경우 일부 서비스 이용이 제한될 수 있습니다.
- 개인정보의 수집, 이용 및 제공에 대한 동의는 언제든지 철회 가능합니다. 동의 철회를 원할 경우 서비스 내 개인정보 관리 기능을 통해 직접 처리하거나, 문의하기 등의 방법으로 연락하여 동의 철회를 요청하십시오.

# 기타
- 기타 개인정보 처리와 관련한 사항은 개인정보 처리방침을 참고하시기 바랍니다.

""";
}
