/// 회원 약관
class Agreement {
  /// 개인 수집 이용 약관
  static String personalCollection = """
## 1. 개인정보의 수집 및 이용

본 서비스는 이용자의 개인정보를 수집하지 않습니다.

## 2. 이미지 처리

서비스 이용 과정에서 사용자가 제공하는 이미지는 처리  
목적으로만 사용되며, 본 서비스의 서버에는 저장되지  
않습니다.

## 3. 개인정보의 저장

사용자의 개인정보는 사용자의 기기 내부에만 저장되며,  
본 서비스의 서버에는 저장되지 않습니다.  
이는 본 서비스가 사용자의 개인정보를 보호하기 위한  
중요한 방침 중 하나입니다.

## 4. 개인정보의 보호

본 서비스는 사용자의 개인정보를 보호하며, 이를 위해  
모든 가능한 기술적, 관리적 대책을 취하고 있습니다.  
사용자의 개인정보는 사용자의 기기 내부에만 저장되며,  
본 서비스의 서버에는 저장되지 않아 외부의 접근이나  
해킹으로부터 안전합니다.

## 5. 개인정보의 변경 및 삭제

사용자는 언제든지 기기 내부에 저장된 개인정보를  
변경하거나 삭제할 수 있습니다. 

## 6. 동의 거부 및 철회

사용자는 본 서비스 이용 도중 개인정보 수집과 사용에 대한 동의를 거부할 수 있으며,  
동의 거부 시 일부 서비스 이용이 제한될 수 있습니다.  
또한, 동의한 개인정보의 수집 및 이용에 대한 동의는  
언제든지 철회할 수 있습니다.

## 7. 문의

본 개인정보 처리 방침에 대한 문의는 스토어 내  
'문의하기' 기능을 통해 문의하실 수 있습니다.
""";
}
