/// 회원 약관
class Agreement {
  /// 개인 수집 이용 약관
  static String personalCollection = """
# Dorothy 개인정보 처리방침

<Dorothy>는 개인정보 보호법 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리지침을 수립.공개합니다.

## **제 1조(개인정보의 처리목적)**

<Dorothy>는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이 변경되는 경우에는 개인정보 보호법 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.

1. AI 촬영/편집 서비스 제공
AI 촬영/편집 서비스 제공을 목적으로 개인정보를 처리합니다.
2. 서비스 제공
서비스, 콘텐츠, 광고를 포함한 맞춤형 서비스 제공을 목적으로 개인정보를 처리합니다.
3. 고충처리
이용자의 신원 확인, 문의사항 확인, 사실조사를 위한 연락, 통지, 처리결과 통보의 목적으로 개인정보를 처리합니다.

## **제2조(개인정보의 처리 및 보유기간)**

1. <Dorothy>는 법령에 따른 개인정보 보유.이용기간 또는 정보주체로부터 개인정보를 수집시에 동의받은 개인정보 보유.이용기간 내에서 개인정보를 처리.보유합니다.
2. 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
    - AI 촬영/편집 서비스 제공
      - 이용자가 제공한 사진, 성별 : 결과물 생성 시까지
      - 결과물 : 이용자 삭제 요청 시까지

## **제5조(정보주체와 법정대리인의 권리.의무 및 행사방법)**

1. 사용자는 정보주체로서 <Dorothy>에 대해 언제든지 개인정보 열람․정정․삭제․처리정지 요구 등의 권리를 행사할 수 있습니다.
2. 개인정보 삭제
    
    앱 내부의 ‘사진 기록’을 통해, 언제든지 기록을 사용자가 지울 수 있습니다.
    

## **제6조(처리하는 개인정보 항목)**

1. <Dorothy>는 다음의 개인정보 항목을 처리하고 있습니다.

| 구분  | 수집·이용목적  | 필수/선택  |  수집 및 이용항목 |
| --- | --- | --- | --- |
| AI 분석 서비스 이용 | AI 결과물 생성 | 필수 | 이용자 사진 |
| 문의하기 | 이용자 문의 및 고충처리  | 필수  | 이메일 |
| 사진 기록 보기 | 사진 기록 | 필수 | 이용자 사진  |   

1.  서비스 이용과정에서 아래 개인정보 항목이 자동으로 생성되어 수집될 수 있습니다. 
IP주소, 쿠키, 서비스 이용기록, 메타 데이터
2.  서비스 이용과정에서 개인정보는 아니지만 아래의 정보가 생성되어 수집될 수 있습니다.
광고식별자, 방문기록, 기기 정보(유형, 모델명, OS 버전, APP 버전, 기기 식별자, 언어 및 국가), 인앱구매 시 제공되는 구매정보(구독 항목, 구독시작/종료일시, 영수증 ID 등), AI 결과물
3.  사진 편집 시, 서비스 제공을 위해 이용자의 사진(또는 갤러리)에 접근할 수는 있지만, 이용자의 사진을 복사하거나 회사의 서버로 전송하지 않습니다.
다만, 이용자가 아래의 기능(필터, 효과 등)을 이용하는 경우에는 회사의 서버로 이용자의 얼굴인식 정보와 메타 데이터, 이미지를 서버로 전송하여 사용 및 처리할 수 있습니다.
서버로 전송된 정보는 이용자가 특정 기능(필터, 효과 등) 사용을 종료하거나 해당 기능을 사용하는 동안 애플리케이션이 종료될 경우 즉시 삭제되며, 서버에 저장되지 않습니다.

## **제7조 (개인정보의 파기)**

1.  <Dorothy>는 이용자로부터 동의 받은 개인정보의 보유기간이 경과하거나 처리목적을 달성하여 더 이상 개인정보가 필요하지 않게 된 경우 지체없이 해당 개인정보를 파기합니다.
2. 개인정보 파기의 절차 및 방법은 다음과 같습니다.    
  1. 파기절차
  처리목적을 달성한 개인정보는 시스템에 의해 자동으로 파기되며, 수동으로 파기해야 하는 경우, 파기 사유가 발생한 개인정보를 선정하여 회사의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.
    
  2. 파기방법
  <Dorothy>는 전자적 파일 형태로 기록·저장된 개인정보는 기록을 재생할 수 없도록 파기하며, 종이 문서에 기록·저장된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.

## **제8조(개인정보의 안전성 확보조치)**

1. <Dorothy>는 개인정보의 안전성 확보를 위해 다음과 같은 조치를 취하고 있습니다.
  - 관리적 조치 : 내부관리계획 수립․시행
  - 기술적 조치 : 개인정보처리시스템 등의 접근권한 관리, 접근통제시스템 설치, 내부 관리계획에 따른 암호화 (전송구간 및 저장 시), 보안프로그램 설치 등

## **제9조(개인정보 자동 수집 장치의 설치∙운영 및 거부에 관한 사항)**
  1. 회사는 이용자들에게 적합하고 보다 유용한 서비스와 광고 서비스(맞춤형 광고 포함)를 제공하기 위해서 이용자의 광고 식별자를 사용하고 있습니다.
  2. 광고 식별자는 이용자가 소유한 스마트폰 및 태블릿 PC의 OS 설정에서 광고에 관한 기능을 활성화한 경우 자동으로 수집되며, 기기의 설정을 변경하거나 광고 플랫폼 사업자의 Opt-Out 기능을 활용함으로써 광고 식별자가 관심 사항에 기반하는 광고에 사용되지 못하도록 거부할 수 있습니다.
  Opt-Out 기능을 설정하더라도 일방형 광고는 전송될 수 있습니다.
    1) 광고 플랫폼 사업자
      • 광고 플랫폼 사업자: Inc Google
    2) 마케팅 정보 수신 차단
      • Android : [설정->Google>개인정보 보호>마케팅 정보 수신] 선택 해제
    3) 개인 맞춤형 광고 차단
      • Android : [설정->Google>광고] 또는 [설정->Google>개인정보 보호>광고] 에서 “광고 개인 최적화 선택 해제” 선택
      • iOS : [설정->개인정보 보호->Apple 광고]에서 맞춤형 광고 선택 해제
    4) 마케팅 분석툴 / 광고 플랫폼 사업자 Opt-Out 기능 활용

## **제10조(개인정보 보호책임자)**

1. <Dorothy>는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

▶ 개인정보 보호책임자

성명 : 강대규(DaeGyu, Kang)

연락처 : [strong0124@naver.com](mailto:strong0124@naver.com)

1.  정보주체께서는 <Dorothy>의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자로 문의하실 수 있습니다. <Dorothy>는 정보주체의 문의에 대해 지체없이 답변 및 처리해드릴 것입니다.

## **제13조(개인정보 처리방침 변경)**

1. 본 개인정보처리방침의 내용 추가, 삭제 및 수정이 있을 경우 혹은 수집하는 개인정보의 항목, 이용목적의 변경 등과 같이 이용자 권리의 중대한 변경이 발생한 경우 필요 시 이용자 동의를 다시 받을 수도 있습니다.
2. 이 개인정보 처리방침은 2023. 09. 18부터 적용됩니다.
""";
}